Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128MU204.h
#define _PTGBTE_OC4TSS_POSITION                  0x00000003
#define _PTGBTE_OC4TSS_MASK                      0x00000008
#define _PTGBTE_OC4TSS_LENGTH                    0x00000001

#define _PTGBTE_OC1CS_POSITION                   0x00000004
#define _PTGBTE_OC1CS_MASK                       0x00000010
#define _PTGBTE_OC1CS_LENGTH                     0x00000001

#define _PTGBTE_OC2CS_POSITION                   0x00000005
#define _PTGBTE_OC2CS_MASK                       0x00000020
#define _PTGBTE_OC2CS_LENGTH                     0x00000001

#define _PTGBTE_OC3CS_POSITION                   0x00000006
#define _PTGBTE_OC3CS_MASK                       0x00000040
#define _PTGBTE_OC3CS_LENGTH                     0x00000001

#define _PTGBTE_OC4CS_POSITION                   0x00000007
#define _PTGBTE_OC4CS_MASK                       0x00000080
#define _PTGBTE_OC4CS_LENGTH                     0x00000001

#define _PTGBTE_IC1TSS_POSITION                  0x00000008
#define _PTGBTE_IC1TSS_MASK                      0x00000100
#define _PTGBTE_IC1TSS_LENGTH                    0x00000001

#define _PTGBTE_IC2TSS_POSITION                  0x00000009
#define _PTGBTE_IC2TSS_MASK                      0x00000200
#define _PTGBTE_IC2TSS_LENGTH                    0x00000001

#define _PTGBTE_IC3TSS_POSITION                  0x0000000A
#define _PTGBTE_IC3TSS_MASK                      0x00000400
#define _PTGBTE_IC3TSS_LENGTH                    0x00000001

#define _PTGBTE_IC4TSS_POSITION                  0x0000000B
#define _PTGBTE_IC4TSS_MASK                      0x00000800
#define _PTGBTE_IC4TSS_LENGTH                    0x00000001

#define _PTGBTE_ADCTS1_POSITION                  0x0000000C
#define _PTGBTE_ADCTS1_MASK                      0x00001000
#define _PTGBTE_ADCTS1_LENGTH                    0x00000001

#define _PTGBTE_ADCTS2_POSITION                  0x0000000D
#define _PTGBTE_ADCTS2_MASK                      0x00002000
#define _PTGBTE_ADCTS2_LENGTH                    0x00000001

#define _PTGBTE_ADCTS3_POSITION                  0x0000000E
#define _PTGBTE_ADCTS3_MASK                      0x00004000
#define _PTGBTE_ADCTS3_LENGTH                    0x00000001

#define _PTGBTE_ADCTS4_POSITION                  0x0000000F
#define _PTGBTE_ADCTS4_MASK                      0x00008000
#define _PTGBTE_ADCTS4_LENGTH                    0x00000001

#define _PTGBTE_PTGBTE_POSITION                  0x00000000
#define _PTGBTE_PTGBTE_MASK                      0x0000FFFF
#define _PTGBTE_PTGBTE_LENGTH                    0x00000010

#define _PTGQPTR_PTGQPTR_POSITION                0x00000000
#define _PTGQPTR_PTGQPTR_MASK                    0x0000001F
#define _PTGQPTR_PTGQPTR_LENGTH                  0x00000005

#define _PTGQUE0_STEP0_POSITION                  0x00000000
#define _PTGQUE0_STEP0_MASK                      0x000000FF
#define _PTGQUE0_STEP0_LENGTH                    0x00000008

#define _PTGQUE0_STEP1_POSITION                  0x00000008
#define _PTGQUE0_STEP1_MASK                      0x0000FF00
#define _PTGQUE0_STEP1_LENGTH                    0x00000008

#define _PTGQUE1_STEP2_POSITION                  0x00000000
#define _PTGQUE1_STEP2_MASK                      0x000000FF
#define _PTGQUE1_STEP2_LENGTH                    0x00000008

#define _PTGQUE1_STEP3_POSITION                  0x00000008
#define _PTGQUE1_STEP3_MASK                      0x0000FF00
#define _PTGQUE1_STEP3_LENGTH                    0x00000008

#define _PTGQUE2_STEP4_POSITION                  0x00000000
#define _PTGQUE2_STEP4_MASK                      0x000000FF
#define _PTGQUE2_STEP4_LENGTH                    0x00000008

#define _PTGQUE2_STEP5_POSITION                  0x00000008
#define _PTGQUE2_STEP5_MASK                      0x0000FF00
#define _PTGQUE2_STEP5_LENGTH                    0x00000008

#define _PTGQUE3_STEP6_POSITION                  0x00000000
#define _PTGQUE3_STEP6_MASK                      0x000000FF
#define _PTGQUE3_STEP6_LENGTH                    0x00000008

#define _PTGQUE3_STEP7_POSITION                  0x00000008
#define _PTGQUE3_STEP7_MASK                      0x0000FF00
#define _PTGQUE3_STEP7_LENGTH                    0x00000008

#define _PTGQUE4_STEP8_POSITION                  0x00000000
#define _PTGQUE4_STEP8_MASK                      0x000000FF
#define _PTGQUE4_STEP8_LENGTH                    0x00000008

#define _PTGQUE4_STEP9_POSITION                  0x00000008
#define _PTGQUE4_STEP9_MASK                      0x0000FF00
#define _PTGQUE4_STEP9_LENGTH                    0x00000008

#define _PTGQUE5_STEP10_POSITION                 0x00000000
#define _PTGQUE5_STEP10_MASK                     0x000000FF
#define _PTGQUE5_STEP10_LENGTH                   0x00000008

#define _PTGQUE5_STEP11_POSITION                 0x00000008
#define _PTGQUE5_STEP11_MASK                     0x0000FF00
#define _PTGQUE5_STEP11_LENGTH                   0x00000008

#define _PTGQUE6_STEP12_POSITION                 0x00000000
#define _PTGQUE6_STEP12_MASK                     0x000000FF
#define _PTGQUE6_STEP12_LENGTH                   0x00000008

#define _PTGQUE6_STEP13_POSITION                 0x00000008
#define _PTGQUE6_STEP13_MASK                     0x0000FF00
#define _PTGQUE6_STEP13_LENGTH                   0x00000008

#define _PTGQUE7_STEP14_POSITION                 0x00000000
#define _PTGQUE7_STEP14_MASK                     0x000000FF
#define _PTGQUE7_STEP14_LENGTH                   0x00000008

#define _PTGQUE7_STEP15_POSITION                 0x00000008
#define _PTGQUE7_STEP15_MASK                     0x0000FF00
#define _PTGQUE7_STEP15_LENGTH                   0x00000008

#define _PTGQUE8_STEP16_POSITION                 0x00000000
#define _PTGQUE8_STEP16_MASK                     0x000000FF
#define _PTGQUE8_STEP16_LENGTH                   0x00000008

#define _PTGQUE8_STEP17_POSITION                 0x00000008
#define _PTGQUE8_STEP17_MASK                     0x0000FF00
#define _PTGQUE8_STEP17_LENGTH                   0x00000008

#define _PTGQUE9_STEP18_POSITION                 0x00000000
#define _PTGQUE9_STEP18_MASK                     0x000000FF
#define _PTGQUE9_STEP18_LENGTH                   0x00000008

#define _PTGQUE9_STEP19_POSITION                 0x00000008
#define _PTGQUE9_STEP19_MASK                     0x0000FF00
#define _PTGQUE9_STEP19_LENGTH                   0x00000008

#define _PTGQUE10_STEP20_POSITION                0x00000000
#define _PTGQUE10_STEP20_MASK                    0x000000FF
#define _PTGQUE10_STEP20_LENGTH                  0x00000008

#define _PTGQUE10_STEP21_POSITION                0x00000008
#define _PTGQUE10_STEP21_MASK                    0x0000FF00
#define _PTGQUE10_STEP21_LENGTH                  0x00000008

#define _PTGQUE11_STEP22_POSITION                0x00000000
#define _PTGQUE11_STEP22_MASK                    0x000000FF
#define _PTGQUE11_STEP22_LENGTH                  0x00000008

#define _PTGQUE11_STEP23_POSITION                0x00000008
#define _PTGQUE11_STEP23_MASK                    0x0000FF00
#define _PTGQUE11_STEP23_LENGTH                  0x00000008

#define _PTGQUE12_STEP24_POSITION                0x00000000
#define _PTGQUE12_STEP24_MASK                    0x000000FF
#define _PTGQUE12_STEP24_LENGTH                  0x00000008

